[
    {
        "name": "Sakir Shalim M",
        "designation": "Director",
        "company": "Asal Engineering Services Pvt. Ltd.",
        "batch": "2012-2016",
        "department": "Civil Engineering",
        "testimonial": "The past years in Sri Sai Ram Engineering College passed by in swift immersing the students with knowledge, patience, and on top of all management abilities necessary to compete in the real world of business. It gave me a platform to push myself and to understand the potentials that were hidden inside me. I would like to thank all the staff in our institute who are still there and who were formerly working as well, for helping me adjust to every situation the whole time.",
         "photo": "/Alumni/CIVIL/SAKIR SALIM M.jpg"
    },
    {
        "name": "N. NIVEDHA",
        "designation": "Executive Director",
        "company": "Ramaanuja Builder",
        "batch": "2012-2016",
        "department": "Civil Engineering",
        "testimonial": "Sai Ram Engineering College is the place where I have learnt the fundamentals of Civil Engineering. It is the base from where I have grown, for every success in my career and I am sure my college 'Sai Ram Engineering College' has played a vital role in it. I thank my college for helping me in achieving my goal in life. I am proud to be a SAIRAMIAN.",
         "photo": "/Alumni/CIVIL/N.NIVEDHA.jpg"
    },
    {
        "name": "Ajith Selvam S",
        "designation": "Quality Engineer",
        "company": "L&T Construction - Kakrapar Atomic Power Project 3&4",
        "batch": "2014-2018",
        "department": "Civil Engineering",
        "testimonial": "Graduating from Sairam Institutions has helped me shape my character and strengthened attitude required to deliver strong results in industry. My four years in the Civil Department were one of my best experiences I ever had. It gave me exposure to various extra-curricular activities along with great academics. It provided all the facilities and encouragement needed to attain high in life. Looking back, I can see my department was extremely important and a stepping stone in my career. It allowed me to develop my interpersonal skills, which are extremely important in any field of work. What made Sairam Institutions special is probably the people who were there with you. We were different in many ways: cultures, religions – but that did not stop us from making friends and being there for each other. Once we left the college, what we could take away with us are only the memories we share and the friendships that would last for many years to come and of course, a now thriving Alumni community. Proud to be a Sairamate.",
         "photo": "/Alumni/CIVIL/AJITH SELVAM S.jpg"

    }
]