[
    {
        "name": "P. Veeramuthuvel",
        "batch": "2001",
        "designation": "Scientist",
        "department": "Mechanical Engineering",
        "company": "ISRO",
        "testimonial": "He joined Sri SaiRam Engineering College in 1997 to complete his engineering studies and then joined IIT Chennai for higher studies and did important research in the aerospace field. Muthuvel joined ISRO without letting the opportunity slip away, never looked back at the opportunities that came from many organizations in the country and abroad, and made it his goal to work in ISRO. After 30 years of experience working on multiple projects and various responsibilities at ISRO, Scientist Veera Muthuvel was appointed as the Director of the Chandrayaan 3 in 2019 replacing scientist Kavitha."
    },
    {
        "name": "Rathish Chamukuttan",
        "batch": "1999-2003",
        "designation": "Principal Engineer (Compiler Development)",
        "company": "Microchip Technologies Pvt Ltd",
        "department": "CSE",
        "testimonial": "It's 20 years, yet it feels like yesterday. Our batch was one of the earliest batches of the CSE Department. We had the chance to learn from a group of motivated and enthusiastic teachers. To my surprise, most of the teachers remember our batch even today! And I am delighted to know many of them still continue to teach in our college. Sairam college taught us to be successful in our professional life by teaching us and providing opportunities to explore, learn and participate in many workshops and symposiums. College life has so many amazing memories, and I am happy that most of our college friends are still in touch and always find time to reminisce about the old college days. Thank You Sairam College for enriching both our professional and personal lives. All the best!"
    },
    {
        "name": "Aravind S",
        "batch": "2012-2016",
        "designation": "Director",
        "department": "Civil Engineering",
        "company": "Asal Engineering Services Pvt. Ltd.",
        "testimonial": "I am a proud Alumnus of Sri Sai Ram Engineering College. I’ve had great support from staffs in building knowledge, planning my career and making great friends. I got the spark about Aluminium formwork from my staffs and was lucky to frame my career on the same. These four years not only helped me broaden the horizon on my knowledge but also improve my interpersonal communication with people. I sincerely thank all the staffs for their support and guidance till date."
    },
    {
        "name": "Mythraye S S",
        "batch": "2012",
        "department": "ECE",
        "designation": "Ex Civil Servant",
        "company": "Indian Armed Forces",
        "testimonial": "I am a transitioning Air Force Officer who has specialized in operation management and technical expertise. After my NCC days as a cadet in Bachelor of Engineering in Electronics and Communications at Sri Sairam Engineering College, I was strongly inclined to join the prestigious forces. Indian Air Force opened its doors on 09 Jul 2012 to achieve my passion which has carved me into a leader who takes her team along! I have served in IAF for 10 years. My core competency is effective people management in a real-time project management scenario coupled with technical expertise in communication and Networking system of Air Defense. HR management was always a part of my job profile. I have also contributed alongside in NGO-like organizations for the betterment of spouses of Armed Forces Personnel. Relationship management and training are also areas where I have worked extensively during my IAF tenure. I am also a vivid fitness enthusiast."
    },
    {
        "name": "R. Prashanthi",
        "batch": "2013-17",
        "designation": "Quality Analyst",
        "department": "EEE",
        "company": "Amazon (Chennai)",
        "testimonial": "College life always holds a special place in my heart. The faculties were the backbone during those 4 years. Right from lab assistants to professors to HOD, every single person helped us perform well in everything we did. They are one of the reasons many of us are successful in our career today. Be it academics, sports, cultural activities, SEC gave us the exposure we wanted. It has been the best in all areas possible. College life is always special to me in many ways and will remain a wonderful memory. Proud to be an alumni of Sairam institution."
    },
    {
        "name": "K. Balasubramaniam",
        "batch": "2008-2012",
        "designation": "Instrumentation Engineer",
        "company": "Essential Systems & Services",
        "department": "EIE",
        "testimonial": "One of the best ways to make yourself happy in the present is to recall the happy moments in the past. One such moment is my Sairam days. The best thing in Sairam is the mentoring system as this helped me overcome the impediments and also to share my own thoughts. Special thanks to my highly dedicated faculty members and Lab Technicians of EIE. Thanks Sairam Management for providing best possible infrastructure and lab facilities."
    },
    {
        "name": "Sivakamasundari S",
        "department": "ICE",
        "designation": "Project Engineer",
        "company": "Cotmac Electronics Pvt. Ltd",
        "testimonial": "I am very proud to be an alumni of Sri Sairam Engineering College, especially from the department of Instrumentation and Control Engineering. The placement cell is excellent and fulfilled my dream. Lots of opportunities to enhance the knowledge in the core area. Really, my Gurus were a strength for career foundation. Today I am very happy to be an Instrumentation and Control Engineer from this College."
    }
]