[
    {
        "name": "R. Prasanna Kumar",
        "designation": "Software Developer",
        "company": "Tata Consultancy Services",
        "batch": "2012-2016",
        "department": "Electronics and Communication Engineering",
        "testimonial": "I, Prasanna Kumar, take the immense pleasure of representing the 2012-2016 batch of Electronics and Communication Engineering Department Students. I am a goal-oriented and studious person and enthusiastic towards learning new concepts. I am very thankful to the Professors of ECE of Sri Sairam Engineering College for giving us extraordinary information and making our essentials solid in each perspective. The practical sessions in our area of expertise enhanced my knowledge to prove in industry. I am happy that even after getting passed out from the College our works are still recognized by the Department and College Management, which helped us in various manners. I am profoundly appreciative to every one of my staff who imparted extraordinary considerations and propelled us to reach great heights. Proud to be a Sairamite!!"
    },
    {
        "name": "Keerthana Mohankumar",
        "designation": "Software Engineer/IoT Developer",
        "company": "Realtek Semiconductor Corp.",
        "batch": "2010-2014",
        "department": "Electronics and Communication Engineering",
        "testimonial": "A determined person capable of learning and adapting to new technology within a short span of time. I take the privilege of representing the 2010-2014 batch of Electronics and Communication Engineering Department Student. I would like to begin with Professors – everyone has their own specific manner of taking classes and I totally enjoyed listening to those classes. Their mentoring system was very effective. The manner in which Professors guided me to confront every semester was an incredible experience and they were agreeable. Discussing about the industrial visits, I got the freedom to visit industries and those were useful to learn things practically. They conducted various project and paper presentation activities apart from our regular activities which increased my intention towards presenting new ideas. I have been part of Department Symposium, Cultural days, and hostel day which I enjoyed a lot in the College Campus. I can say firmly that Department teachers provided sufficient information and certainty to confront many testing things in my day-to-day life. The campus was top in providing numerous facilities for both curricular and co-curricular activities. The resources and staff members I got in Sairam were perhaps the best thing that happened in my life since we are still maintaining the same bond and they are guiding me during my critical circumstances. Finally, I thank all Professors who made me achieve many things and reach higher levels in my life. Proud to be a Sairamite!!"
    },
    {
        "name": "Yusuf Shabbir Durbar",
        "designation": "Director, Engineering and Manufacturing Excellence",
        "company": "BlueScope Coated Products",
        "batch": "Unknown",
        "department": "Electronics and Communication Engineering",
        "testimonial": "My college life is the best timeframe of my life. Enter as a youngster, went out as an incredible energetic boss. The four years of college life will remain as the most astonishing part of our lives. We were very happy and made the best from my friends and had a very enjoyable time at college. As an event manager of TEDx Sairam, under the theme 'inventing innovations,' I had the responsibility of finding speakers and organizing the entire event, taking care of every minute detail. This gave me a big platform to work in a team and also helped me explore my leadership and communication skills. The development from academia to industry was achieved by my Professors, staff, and management. They acted as an emotional support, equipping us with the skills needed to face the real world. We didn't understand it at the time, but even the rules and guidelines, which seemed daunting then, turned out to be beneficial in our professional lives. They taught us the importance of career and guided us to move forward. It is a great pleasure to have continuous contact with them, and they still help make my dreams come true. Thanks to all."
    },
    {
        "name": "Ms. S.Devi",
        "designation": "Director",
        "company": "Ramskar Agencies Private Ltd",
        "batch": "2003-2007",
        "department": "Electronics and Communication Engineering",
        "testimonial": "Sairam has helped to mold me and develop and grow as a better individual. I would not be exaggerating in my assessment that the faculty are the true asset of Sairam. The amount of care and dedication that they show to each and every student is astounding and that care actually reaches the student and transforms them, enabling tremendous growth professionally as an engineer and personally as a human being. I thank from the bottom of my heart, all the faculties of Sairam, who changed my life for the better and showed me what compassion is and who an actual teacher is, and their profound impact on the life of a student."
    },
    {
        "name": "Aravinth Raj",
        "designation": "Software Development Engineer",
        "company": "Expedia Group",
        "batch": "2012-2016",
        "department": "Electronics and Communication Engineering",
        "testimonial": "We had the chance to learn from a group of motivated and enthusiastic teachers. To my surprise, most of the teachers remember our batch even today! Sairam College taught us to be successful in our professional life by providing opportunities to explore, learn, and participate in many workshops and symposiums. College life has so many amazing memories, and I am happy that most of our college friends are still in touch and always find time to reminisce about the old college days. Thank you, Sairam College, for enriching both our professional and personal lives. All the best!"
    },
    {
        "name": "Padmavathi",
        "designation": "Associate Consultant",
        "company": "Capgemini",
        "batch": "2016-2020",
        "department": "Electronics and Communication Engineering",
        "testimonial": "I'm deeply thankful to the teachers at Sri Sairam Engineering College. Their mentorship boosted my skills, including lab work, projects, and innovation. This solid foundation nurtured skills and enabled success in the industry. This academic exposure set me on a path to excel in data analysis and become a skilled engineer."
    },
    {
        "name": "R. Siva Santhosh Raj",
        "designation": "FPGA Engineer",
        "company": "Bengaluru",
        "batch": "2012-2016",
        "department": "Electronics and Communication Engineering",
        "testimonial": "Experienced System Engineer with a demonstrated history of working in Engineering services industry. Skilled in Verilog, VHDL, TCL, ClearCase, Matlab, C, LTE, Verizon 5G, RTL design, test automation, and Python. Good knowledge on usage of Xilinx Vivado, Chipscope, Xilinx FPGA families like Virtex 7 and Zynq Ultrascale+, and Intel FPGA families like Stratix 10 DX and MX. Strong Electronics and Communication professional graduated from Sri Sairam Engineering College."
    },
    {
        "name": "Aravindakshan G A",
        "designation": "Research Assistant",
        "company": "Wadhwani Electronics Laboratory",
        "batch": "2017-2021",
        "department": "Electronics and Communication Engineering",
        "testimonial": "A passionate learner and a professional who thrives for knowledge to its deep source. Pursuing my graduation in Electronics and Communication Engineering, I am much aspired to become an engineer who is skillful in all domains of Engineering Sciences. A good team player and holds a spirit of leading the team. Strong in design and integration with intuitive problem-solving skills. Passionate about implementing and launching new projects. Ability to translate business requirements into technical solutions."
    },
    {
        "name": "Srinidhi Varadharajan",
        "designation": "Software Engineer E3",
        "company": "GAVS Technologies",
        "batch": "Unknown",
        "department": "Electronics and Communication Engineering",
        "testimonial": "I am Srinidhi Varadharajan, currently working as a Software Engineer E3 in GAVS Technologies. I am a very proud alumni of Sairam institution. This college provided me with good infrastructure and facilities to equip my knowledge. I secured 28th university rank in the ECE domain. My professors enlightened me with good subjective and practical knowledge. This guidance has helped me to excel in my career. Apart from academics, the college motivated me to participate in other curricular activities. I am very grateful to this wonderful institution."
    },
    {
        "name": "Arvind Ramana",
        "designation": "Director Space Programs",
        "company": "Australian Space Agency - Technology Uplift",
        "batch": "Unknown",
        "department": "Electronics and Communication Engineering",
        "testimonial": "My Department nurtured me with technical skills – theoretical and practical which I enjoyed. Every subject that I learnt at Sairam ECE has helped me further my career at various stages. When I look back at the things that I have been doing at work, it all strikes back on how relevant the skills are. People find it funny to say how their education does not help them in real life but I would gladly get into that debate any day. I enjoyed my lab sessions in particular – the amount of learning that came from the hands-on and from documenting the results cannot easily be quantified – but trust me it is immense. Amongst numerous other things, I would absolutely thank my department for empowering and encouraging me to pursue new things. Be it paper presentations, quizzes, sports, adzaps, or dumb-charades – the Department encouraged and allowed me in various pursuits. It helped widen my exposure, awareness, interests, and horizons. When I now look back and recollect all the great memories of my 4 years at Sairam, it is filled with great nuggets of precious moments and whatever little negative experiences that might have happened never come up. So if you have any such gloomy days – remember that when you look back at it one day it will fade in significance compared to the good times and massive lifelong learning. When I thank my Department and the college for all the learning, my gratitude would not be complete without thanking the college for providing me the ecosystem to foster long-lasting close friendships without which my journey would never be complete."
    }
]