[
    {
        "name": "Hari Prasath.H",
        "batch": "2009-2013",
        "designation": "Clerk",
        "company_name": "Bank of Baroda / Dept of General Administration",
        "department": "EIE",
        "testimonial": "I am proud of being educated in EIE department. My professors shaped and elevated me to this place as a professional in the Finance sector. My Professors guided me a lot and never stopped supporting me to achieve my university rank during my under graduation. I treasure my very special days at Sairam for the whole of my lifetime. I developed my leadership skills by being the coordinator of various workshops, guest lectures conducted by the department."
    },
    {
        "name": "Sachin Rengarajan",
        "batch": "2009-2013",
        "designation": "Controls Engineer",
        "company_name": "Cummins Inc, USA",
        "department": "EIE",
        "testimonial": "During my years at Sairam, the infrastructure provided by the department of EIE and also the rest of the campus were commendable. The faculty were always of great support during the times students struggled with their courses offering personal attention. The college also had good rapport with the corporate world that brought in job opportunities. It was more helpful for the students from various branches in finding opportunities/internships in the core industries and also help in training for GATE examinations. The College is currently encouraging students to prepare for competitive exams like GRE, IELTS etc which is greatly appreciated. Best wishes to the team of professors and the support faculty. Many thanks for reaching out."
    },
    {
        "name": "Annapurani V",
        "batch": "2010-2014",
        "designation": "Systems Engineer",
        "company_name": "TCS",
        "department": "EIE",
        "testimonial": "Right from excellent faculty who helped us gain expertise in the subjects to the state-of-the-art lab facilities, the college provided everything a student would require to become a good engineer. It also helped us prepare for real-world scenarios through symposiums, workshops, and events like TEDx. I cherish every moment of the four years I spent at Sairam during the course of my engineering degree."
    },
    {
        "name": "R. Vijayaraghavan",
        "batch": "2010-2014",
        "designation": "SAP Consultant",
        "company_name": "Cap Gemini",
        "department": "EIE",
        "testimonial": "I’m proud to be a part of the Sairam family. I had a great time during my study in Sairam. All the department staff and my mentor supported me a lot in all my walks of college life. I had a chance to be the class representative and student chairman, which helped me to build my leadership and management skills. I learned a lot about people management and organizing events. My sincere thanks to all department staff members for encouraging and motivating me during my hard times, which stood as a platform for elevating me to the position where I am today. Cheers!"
    },
    {
        "name": "V.R. Sidharth",
        "batch": "2010-2014",
        "department": "EIE",
        "testimonial": "Sairam has got one of the best infrastructures and brilliant faculty that an educational institution can have. Faculty members provide students with great exposure to broaden their knowledge and a platform to grow beyond their field of studies with a multi-cultural environment. The friendly attitude of professors and their readiness to offer help made me feel very comfortable in the EIE family. I cherish the memories and the favorite pastimes I had in my life! I look forward to keeping in touch always while I’m away…"
    },
    {
        "name": "Subramanian Veerappan",
        "batch": "2010-2014",
        "designation": "Senior Application Engineer",
        "company_name": "Schneider Electric Systems India Pvt Ltd",
        "department": "EIE",
        "testimonial": "I am proud to say I am a 2010 - 2014 EIE Batch alumni of an esteemed college such as Sairam Engineering College. The moment I think about this institution, I am filled with radiant and jocular emotions throughout. My college life is one of the best periods I have enjoyed till date, be it the friends I had got for life, vastly knowledgeable teachers, or facilities that were second to none. More than anything, I have learned about patience, perseverance, and hard work from my college times. Even though I found it a bit tough to cope up at certain times in the college, now I believe I am reaping all the benefits of successfully completing those days. As the quote goes, 'If you want to shine like a diamond, be prepared to handle pressure like one.'"
    },
    {
        "name": "Raksha Devanathan",
        "batch": "2013-2017",
        "designation": "Dance Instructor",
        "company_name": "Pursuing Masters in Bharathanatyam",
        "department": "EIE",
        "testimonial": "I am a proud alumnus of Sairam. Sairam motivated me as a dancer and gave a lot of opportunities in every occasion of college. Even after I chose dance as my profession, which is entirely a different field but my passion, my college motivated me a lot. Proud Sairamite."
    },
    {
        "name": "B. Rohnie",
        "batch": "2013-2017",
        "designation": "Application Developer",
        "company_name": "Bank of New York Mellon",
        "department": "EIE",
        "testimonial": "My journey at Sairam turned out to be jubilant. I was nurtured with good mannerism that plays a great role even now. The opportunities I grabbed crowned me with exceptional achievements. It started from departmental symposiums to International Conferences. Proud to have been selected by the IEDC which took me places I didn’t even know about. At last, I would never forget the constant love, care, and support of my professors to help me climb the ladder. At Sairam, it was not just academics that made me secure the 33rd University rank but much more… It’s up to us to stand with a bucket or a spoon."
    },
    {
        "name": "Vaishali",
        "batch": "2014-2018",
        "department": "EIE",
        "testimonial": "Well, they say you know the value of something only when it is far away from your reach. College has been one such thing in life, which almost all of us regret not going once we leave. It is indeed true the amount of heed you are paid when you are brought up in such a responsible environment is truly appreciated by the outside world. Every time I get appraised for the conduct I have, it not only gives me a name but I know it is laurel to my Alma mater. In spite of a coin having two sides, our college has been a key to growth in career and personal attitude."
    }
]