[
    {
        "name": "R. Mohamed Aslam",
        "designation": "Instrumentation Engineer",
        "company": "Petro6 Engineering and Construction - Chennai",
        "batch": "2018-2022",
        "department": "ICE",
        "testimonial": "Reflecting on my time at Sai Ram Engineering College, I am immensely grateful for the transformative experience I had, particularly in the Instrumentation & Control Engineering Department. The unwavering support and guidance from Mrs. Mangayarkarasi ma'am, Mr. Chitra Kannan sir, and the entire faculty were instrumental in shaping my academic journey. Their mentorship went beyond conventional teaching, offering a holistic learning experience that bridged theory and practice. Despite the challenges, especially during the pandemic, the faculty's dedication ensured that our learning continued seamlessly. Sai Ram Engineering College has truly been a nurturing ground for knowledge, innovation, and personal growth, and I carry forward the pride of being an alumnus with great respect and gratitude.",
        "photo":"/Alumni/ICE/RMOHAMEDASLAM.png"
    },
    {
        "name": "Mr. D. Mahesh",
        "designation": "Senior Technical Professional",
        "company": "KBR-INDIA",
        "batch": "2006-2010",
        "department": "ICE",
        "testimonial": "I am proud to be an alumnus of Sri Sairam Engineering College. The opportunities provided to develop my skills and knowledge have been invaluable for my professional growth. The Instrumentation and Control field was in high demand during my time, and the support from the management, HOD Madam, and senior faculty members like Mr. Chitharakkannan played a crucial role in my career. With over 17 years of experience in my field, I remain deeply thankful for the mentorship and will cherish my lifelong association with my alma mater.",
        "photo":"/Alumni/ICE/MRDMAHESH.png"
    },
    {
        "name": "Vishalakshi Meyyappan",
        "designation": "Java - Microservice Developer - SE C1",
        "company": "Tata Consultancy Services - Chennai",
        "batch": "2018-2022",
        "department": "ICE",
        "testimonial": "My journey at Sai Ram Engineering College has been profoundly impactful. The guidance from Mrs. Mangayarkarasi, our esteemed HOD, and other faculty members like Mr. Balaji N, Mr. Ilayaraja, and Mrs. Jayanthi was pivotal in my development. Their dedication to fostering a drive for quality and innovation has greatly shaped my professional ethos. The holistic education and support provided during my time there have prepared me well for the industry. I carry the pride of this institution's tradition with me and extend my heartfelt thanks to all the mentors who have guided me.",
        "photo":"/Alumni/ICE/VISHALAKSHIMEYYAPPAN.png"
    },
    {
        "name": "Sivakamasundari S",
        "designation": "Project Engineer",
        "company": "Cotmac Electronics Pvt. Ltd",
        "batch": "2018-2022",
        "department": "ICE",
        "testimonial": "I am extremely proud to be an alumna of Sri Sairam Engineering College, particularly from the Instrumentation and Control Engineering department. The exceptional education and mentorship I received were critical in laying the foundation for my career. The faculty's commitment to providing comprehensive knowledge and industry-relevant skills has been invaluable. The college's focus on holistic development and career opportunities helped me become a successful engineer. I am grateful for the support and opportunities provided during my time at Sairam.",
        "photo":"/Alumni/ICE/SIVAKAMASUNDARIS.png"
    },
    {
        "name": "Kamakshi Muthukrishnan",
        "designation": "Machine Learning Automation Engineer",
        "company": "Cognizant Technology Solutions - Chennai",
        "batch": "2005-2009",
        "department": "ICE",
        "testimonial": "My journey with Sairam Engineering College has been a source of great pride. The exceptional education and mentorship provided by the faculty were crucial in my development as an Instrumentation & Control Engineer. The support from the institution and the emphasis on practical learning prepared me well for my career. I am particularly grateful for the guidance from Mrs. Kalaiselvi and other staff members, which instilled a passion for excellence and innovation. The friendships and experiences gained during my time at Sairam are cherished, and I continue to be proud of my association with the college.",
        "photo":"/Alumni/ICE/KAMAKSHIMUTHUKRISHNAN.png"
    },
    {
        "name": "Anuja Arumugam",
        "designation": "Merchandiser",
        "company": "Ford Global Technology & Business Centre - Chennai",
        "batch": "2016-2020",
        "department": "ICE",
        "testimonial": "Joining Sairam Engineering College marked the beginning of a transformative journey for me. The college offered a wealth of opportunities beyond academics, including invaluable life lessons from mentors and peers. The experiences and education I received helped me discover my skills and capabilities, shaping my career as a Supply Chain Merchandiser at Ford. I encourage current students to fully embrace the opportunities and learnings at Sairam, as these will greatly enrich their personal and professional lives. My time at Sairam was more than just academic; it was a journey of growth, friendships, and discovering one's potential.",
        "photo":"/Alumni/ICE/ANUJAARUMUGAM.png"
    }
]