[
    {
        "name": "Radha Jeganathan",
        "designation": "Plant Quality Head",
        "company": "Stellantis Powertrain Plant, Hosur",
        "batch": "2010",
        "department": "Mechanical Engineering",
        "testimonial": "Radha was one of the glorified students of Sairam of batch 2006-2010, for receiving a University Rank in Mechanical Engineering. Having had a very good academic launch pad, she joined Rane NSK to begin her professional career. She later shaped her career as a Quality Engineer gaining valuable experience for 5 years in Renault. She later pursued an MBA to strengthen her competency towards her ambitious goals in the automotive field. Advancing further, she has been an integral part of the global automotive supergiant Stellantis's plant to gain a foothold in the Indian market. At present, she is making Sairam proud by having become the Plant Quality Manager for Stellantis and being crucial for launching their Indian car models Citroen C5 Aircross and C3 plus handling all export customers in Europe and Latin America."
    },
    {
        "name": "Mr. M Arunachalam",
        "designation": "R&D Engineer",
        "company": "MRF Ltd",
        "batch": "2012",
        "department": "Mechanical Engineering",
        "testimonial": "A passionate R&D engineer specializing in the area of solid mechanics. Currently, his work is focused towards understanding the mechanical behavior of rubbers and biomaterials. Apart from his day job, he spends time educating people about the importance of health & wellness, career, and financial planning."
    },
    {
        "name": "Lt Cdr RP Kamalakannan",
        "designation": "Air Engineer Officer",
        "company": "Indian Navy",
        "batch": "2015",
        "department": "Mechanical Engineering",
        "testimonial": "Kamal successfully cleared the Services Selection Board for Air Force as well as Navy and got commissioned in Indian Navy in the year 2016 as Sub Lieutenant. He had been promoted twice and is currently serving in the rank of Lieutenant Commander at Mumbai. He served onboard India’s lone Aircraft Carrier INS Vikramaditya as 'Aircraft Engineer' and was involved in military operations of MiG-29K fighter, Kamov, Sea King, ALH, and Chetak Helicopters."
    },
    {
        "name": "Poovarasan Raja",
        "designation": "Manufacturing Engineer",
        "company": "TESLA, USA",
        "batch": "2017",
        "department": "Mechanical Engineering",
        "testimonial": "Automotive engineer with experience in IC engines as well as electric vehicles. Currently, working on the virtual development of passenger SUVs using model-based development. He was part of the team of EBaja representing our college and that started the automotive journey."
    },
    {
        "name": "Kevin Chandrasekar",
        "designation": "Research & Development Specialist",
        "company": "Daimler, Germany",
        "batch": "2015",
        "department": "Mechanical Engineering",
        "testimonial": "In this era of competition, it is essential to have a state-of-the-art team to develop the software, be it commercially-off-the-shelf product updates and development from scratch! Our Training team not only has mastery of the technology but also in processes and methodologies around the software development life cycle."
    },
    {
        "name": "Siddharth Ram M R",
        "designation": "Program Manager-II",
        "company": "Amazon, Chennai",
        "batch": "2011-2015",
        "department": "Mechanical Engineering",
        "testimonial": "Completed Mechanical Engineering at Sri Sairam Engineering College (2011-2015 batch, Anna University Rank #12). Started professional journey as Graduate Engineer Trainee (GET) at Reliance Industries Limited (Navi Mumbai) in their petrochemicals business, handled Operations & Maintenance for RIL-PMD Energy Center (Captive Power Plant). In 2016, switched to Reliance Retail Limited (Bangalore HQ) and worked as Manager – Special Projects in Supply Chain Management function, responsible for E2E SCM operations for 500+ stores - Fashion & Lifestyle business (TRENDS, Project EVE). Completed MBA (Operations, Finance) at Great Lakes Institute of Management (Chennai) in 2020, and got selected by Amazon during campus placements. Currently, Program Manager-II at Amazon (Chennai), handling new device launches (third-party products) in the consumer electronics space, hardware/software lifecycle management by engaging with domestic and international 3P partners."
    },
    {
        "name": "Prem Vinayak",
        "designation": "Engineer, Advance Vehicle Architecture",
        "company": "Mahindra Research Valley, Chennai",
        "batch": "2020",
        "department": "Mechanical Engineering",
        "testimonial": "An Engineer working in the domain of Vehicle Architecture, associated with multiple Born Electric Vehicle projects of Mahindra and Mahindra Ltd. He has expertise in the domain of Ergonomic simulations & Upper body styling to Engineering convergence."
    },
    {
        "name": "Ram Dhiwakar Seetharaman",
        "designation": "Solution Engineer and Program Manager",
        "company": "Synera GmbH, Germany",
        "batch": "2020",
        "department": "Mechanical Engineering",
        "testimonial": "Simulation Engineer with a background in Computational Mechanics from the University of Stuttgart. Worked for a couple of years at Volocopter in Electric Propulsion System Structures, and also parallelly in Electric Motorsports involving Digital Twin and AI Techniques for Structural Simulations. Currently, he is working in Synera GmbH as a Solution Engineer, helping companies and Mechanical Engineers implement digitalization and automation for CAD and CAE processes."
    },
    {
        "name": "M MeghaVahini",
        "designation": "Sub Lieutenant",
        "company": "Short Service Commission, Indian Navy",
        "batch": "2017-2021",
        "department": "Mechanical Engineering",
        "testimonial": "Mechanical graduate aspired to join the armed forces. Participated in various NCC camps, marks women in her squad in college. Got placed in 2 companies, worked for almost a year at Infosys as a System Engineer, skilled in GCP. Currently, she is under training at Indian Naval Academy. Post completion of her training, she will be joining as an officer in the Indian Navy. Ex-Air Wing NCC Cadet to Officer in the Indian Navy."
    }
]